---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumber
source: html/d444f845-6d96-f78e-b692-6fd618404ad8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumber Property

"Number"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternNumber { get; }
```